{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping two homepage-related features to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend files.",
  "frontend/index.css": "Tailwind base setup defining light/dark OKLCH theme tokens and global background/text behavior.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with six main routes and renders them via RouterProvider.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper providing TopNav, routed content, Discord CTA, and Footer.",
  "frontend/src/components/marketing/DiscordCTABlock.tsx": "Discord call‑to‑action card linking to the marketing content’s Discord URL.",
  "frontend/src/components/marketing/FAQSection.tsx": "FAQ accordion section populated from marketing content with animated reveal.",
  "frontend/src/components/marketing/FeaturesSection.tsx": "Feature grid displaying Minecraft‑style icon cards pulled from marketing content.",
  "frontend/src/components/marketing/FinalCTASection.tsx": "Final call‑to‑action card linking to Plans and About using marketing content copy.",
  "frontend/src/components/marketing/Footer.tsx": "Footer with branding, nav links, and social icons driven by marketing content.",
  "frontend/src/components/marketing/HeroSection.tsx": "Hero section showing updated headline/subheadline and a single Get Started button linking to /plans.",
  "frontend/src/components/marketing/MotionInView.tsx": "Component that reveals children with a fade/slide animation when entering the viewport, respecting reduced-motion preferences.",
  "frontend/src/components/marketing/PricingSection.tsx": "Renders the pricing section using marketing content, showing plan cards with animations and CTAs.",
  "frontend/src/components/marketing/SectionShell.tsx": "Layout wrapper providing consistent section padding, container sizing, and optional ID.",
  "frontend/src/components/marketing/SocialProofSection.tsx": "Displays testimonial cards with animated reveal using marketing content.",
  "frontend/src/components/marketing/TopNav.tsx": "Responsive top navigation bar with scroll styling, mobile menu, and CTA using marketing content.",
  "frontend/src/content/marketingContent.ts": "Static configuration object containing navigation, hero text, features, pricing, and testimonials for marketing pages.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to the user's Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks managing Internet Identity login, stored identity loading, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting that no backend queries are required.",
  "frontend/src/index.css": "Tailwind base setup defining light/dark OKLCH color tokens and custom utility/component styles with Minecraft‑inspired UI classes.",
  "frontend/src/main.tsx": "React entry point initializing React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with animated marketing sections for mission, vision, and story using mc-card components.",
  "frontend/src/pages/HomePage.tsx": "Composes the homepage from hero, features, social proof, and final CTA marketing sections.",
  "frontend/src/pages/LandingPage.tsx": "Full marketing landing page combining top nav, multiple feature sections, pricing, FAQ, and footer.",
  "frontend/src/pages/MorePage.tsx": "Displays FAQ and a resource list using mc-card components with animations.",
  "frontend/src/pages/PaymentMethodPage.tsx": "Shows payment methods and security details using marketing content and animated mc-card layouts.",
  "frontend/src/pages/PlansPage.tsx": "Simple page rendering the PricingSection with spacing.",
  "frontend/src/pages/ReviewPage.tsx": "Page that displays social proof testimonials via SocialProofSection.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors from CSS variables, adding plugins, custom shadows, keyframes, and fonts.",
  "project_state.json": "Tracks project metadata, existing features, pending requests, and configuration for updating homepage hero content and CTA."
}