{
  "backend/main.mo": "Implements feedback submission, storage, admin-restricted retrieval, and optional Discord webhook posting with access control.",
  "backend/migration.mo": "Defines a no-op migration that returns the previous state unchanged.",
  "feature_evidence.json": "Describes feature evidence linking feedback form features to specific frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files, their responsibilities, and UI behaviors.",
  "frontend/index.css": "Defines global Tailwind CSS variables and themes for light/dark modes and base styling.",
  "frontend/index.html": "HTML entrypoint loading the root React app via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router with multiple routes and renders the router provider.",
  "frontend/src/components/feedback/FeedbackFormSection.tsx": "Renders a feedback form with Discord username support, success/error handling, and mutation-based submission.",
  "frontend/src/components/layout/SiteLayout.tsx": "Provides the global layout with navigation, routed content, Discord CTA, and footer.",
  "frontend/src/components/marketing/DiscordCTABlock.tsx": "Displays a Discord CTA card with support email and a join button.",
  "frontend/src/components/marketing/FAQSection.tsx": "Renders FAQ items using an accordion with marketing content.",
  "frontend/src/components/marketing/FeaturesSection.tsx": "Displays a grid of circular feature cards using marketing content.",
  "frontend/src/components/marketing/FinalCTASection.tsx": "Renders a final call‑to‑action section with headline, subheadline, and two CTA buttons using marketing content.",
  "frontend/src/components/marketing/Footer.tsx": "Displays footer with branding, product and company links, social icons, and dynamic year handling using marketing content.",
  "frontend/src/components/marketing/HeroSection.tsx": "Creates the hero banner with headline, subheadline, and primary CTA button animated into view.",
  "frontend/src/components/marketing/MotionInView.tsx": "Wraps content with an intersection‑observer fade/slide‑in animation, respecting reduced‑motion settings.",
  "frontend/src/components/marketing/PricingSection.tsx": "Shows pricing plans with features, images, and CTA buttons, highlighting recommended plans and animating items in.",
  "frontend/src/components/marketing/SectionShell.tsx": "Provides a styled section wrapper with padding, container layout, and optional id.",
  "frontend/src/components/marketing/SocialProofSection.tsx": "Displays testimonials with quotes and authors in an animated grid layout using marketing content.",
  "frontend/src/components/marketing/TopNav.tsx": "Implements a responsive top navigation bar with scroll effects, links, CTA button, and mobile menu.",
  "frontend/src/content/marketingContent.ts": "Defines static marketing content, including navigation items, hero text, features, testimonials, and pricing data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Re-exports the feedback submission mutation hook.",
  "frontend/src/hooks/useSubmitFeedbackMutation.ts": "Defines a mutation for submitting feedback through the backend actor with basic validation.",
  "frontend/src/index.css": "Configures Tailwind and theme variables plus styling for light/dark modes and custom components.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, story sections, and FAQ.",
  "frontend/src/pages/HomePage.tsx": "Assembles the main home page sections including hero, features, social proof, and feedback form.",
  "frontend/src/pages/LandingPage.tsx": "Builds the marketing landing page with navigation, hero, features, pricing, FAQ, and footer.",
  "frontend/src/pages/MorePage.tsx": "Placeholder page indicating more content coming soon.",
  "frontend/src/pages/PaymentMethodPage.tsx": "Displays payment method options, conditions, and security info using marketing content.",
  "frontend/src/pages/PlansPage.tsx": "Shows the pricing section with a Buy Now link.",
  "frontend/src/pages/ReviewPage.tsx": "Shows the social proof section as a standalone review page.",
  "frontend/src/pages/TermsOfServicePage.tsx": "React page rendering styled Terms of Service sections with animated components and icon headers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL params, persisting them in sessionStorage, and cleaning them from URL hashes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, shadows, container settings, and animations.",
  "project_state.json": "JSON file describing the project’s state, existing features, and pending feature requests related to feedback and Discord integration."
}