{
  "kind": "build_request",
  "title": "Add Terms of Service page after Payment Method",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new Terms of Service (TOS) page that is accessible via a new route (e.g., \"/tos\") and uses English user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Create a page TOS after payment method"
        ]
      },
      "acceptanceCriteria": [
        "A new page component exists at a non-immutable path under frontend/src/pages (e.g., TermsOfServicePage.tsx or TosPage.tsx).",
        "App routing includes a new route for the TOS page (e.g., path \"/tos\") and it renders inside the existing SiteLayout.",
        "The TOS page content is written in English and is readable (clear headings/sections) with styling consistent with the existing Minecraft-themed cards/typography used across other pages."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Payment Method page to provide a clear next-step navigation to the new TOS page (i.e., a prominent button/link placed after the payment-method content).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Create a page TOS after payment method"
        ]
      },
      "acceptanceCriteria": [
        "The Payment Method page includes a visible call-to-action near the bottom (after the existing sections) that navigates to the TOS route when clicked.",
        "Navigation uses TanStack Router <Link> (consistent with the rest of the app) and works on both desktop and mobile.",
        "No existing Payment Method content is removed or broken."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Expose the new TOS page in site navigation data so it appears after \"Payment Method\" in the configured navigation list, and add it to the footer links where appropriate.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Create a page TOS after payment method"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/content/marketingContent.ts includes a new navigation entry for the TOS route placed immediately after the existing \"/payment\" entry.",
        "Footer link lists (from marketingContent.footer.*Links) include a Terms of Service entry pointing to the TOS route (placement consistent with existing categories).",
        "Top navigation renders the new Terms of Service link without layout issues in desktop and mobile menus."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (shadcn components are read-only).",
    "Do not modify any frontend immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep backend unchanged; this is a static/legal content page addition with frontend routing/navigation only."
  ],
  "nonGoals": [
    "Implementing or modifying actual payment processing, checkout, or post-payment verification flows.",
    "Legal review or generation of jurisdiction-specific enforceability; provide a standard, generic Terms of Service structure in English.",
    "Adding authentication requirements or gating access to the TOS page."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}