{
  "kind": "build_request",
  "title": "Add suggestions/feedback form and send submissions to a Discord channel",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a user-facing suggestions/feedback form in the frontend where visitors can submit feedback text (and optionally their name and contact info), and show clear success/error states in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "If i want to add a form where people can drop there suggestions feedback and I will receive then in a discord channel ? Can I do this"
        ]
      },
      "acceptanceCriteria": [
        "A new UI section or page contains a feedback form with at least a required message field.",
        "Client-side validation prevents submitting empty messages and enforces reasonable max lengths (e.g., message <= 2000 chars).",
        "On submit, the UI shows a loading state, then either a success confirmation (form resets) or an error message.",
        "All user-facing strings added for this feature are in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a backend Motoko API to accept feedback submissions, persist them (at least as an append-only log), and forward each submission to a specified Discord channel using a Discord webhook URL.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I will receive then in a discord channel"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes an update method to submit feedback (message + optional fields) and returns a success/error result.",
        "Each accepted submission is stored in canister state so it can be retrieved later (e.g., for auditing/debugging).",
        "On successful submission, the backend attempts to POST a formatted message to the configured Discord webhook URL.",
        "If the Discord webhook call fails, the backend returns a clear error result and still records the submission status (e.g., pending/failed/sent)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an admin-only mechanism to configure or update the Discord webhook URL used for forwarding feedback submissions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "receive then in a discord channel"
        ]
      },
      "acceptanceCriteria": [
        "There is a backend method to set/update the Discord webhook URL.",
        "Only an authorized identity (e.g., canister controller/admin principal) can set/update the webhook URL; unauthorized calls are rejected.",
        "The webhook URL is not hardcoded in the frontend."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Wire the frontend feedback form submission to the backend feedback API using React Query, and handle backend validation/errors gracefully.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "Submitting the form calls the backend actor method via the existing actor/hook patterns.",
        "Frontend displays backend validation errors (e.g., message too long) without crashing.",
        "Duplicate rapid submissions are prevented in the UI while a submission is in-flight."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose them instead).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if state upgrades require it.",
    "Discord delivery must use a Discord webhook URL provided/configured by the project owner; no third-party Discord bot libraries or external servers.",
    "Use HTTPS outcalls from the canister (if required by the chosen implementation); do not introduce non-IC backend services."
  ],
  "nonGoals": [
    "Building a full Discord bot with gateway events, slash commands, or OAuth installation.",
    "Adding third-party anti-spam services (CAPTCHA providers) or email/SMS notifications.",
    "Real-time chat or WebSocket-based messaging."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}