{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Feedback form UI and React Query submission wiring",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a user-facing feedback form section with optional name/contact fields and clear English success/error states.",
      "acceptanceCriteria": [
        "A new UI section or page contains a feedback form with at least a required message field.",
        "Client-side validation prevents submitting empty messages and enforces reasonable max lengths (e.g., message <= 2000 chars).",
        "On submit, the UI shows a loading state, then either a success confirmation (form resets) or an error message.",
        "All user-facing strings added for this feature are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/feedback/FeedbackFormSection.tsx",
          "operation": "create",
          "description": "Create a reusable FeedbackFormSection component that renders inputs for message (required), name (optional), and contact info (optional), with client-side validation (non-empty message, message length <= 2000, reasonable limits for optional fields) and English success/error/loading UI. Use shadcn-ui components (e.g., Button, Input, Textarea, Card/Alert equivalents) to match existing design; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Wire the new FeedbackFormSection into the existing HomePage as a new section (use the existing SectionShell pattern and provide a stable section id for in-page linking if needed). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add minimal global styling adjustments only if needed to support the feedback section (spacing/scroll offset consistency with SectionShell), keeping all user-facing strings in English and maintaining the existing theme tokens. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Submit feedback via React Query using existing actor patterns and handle backend errors gracefully while preventing duplicate in-flight submissions.",
      "acceptanceCriteria": [
        "Submitting the form calls the backend actor method via the existing actor/hook patterns.",
        "Frontend displays backend validation errors (e.g., message too long) without crashing.",
        "Duplicate rapid submissions are prevented in the UI while a submission is in-flight."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSubmitFeedbackMutation.ts",
          "operation": "create",
          "description": "Add a dedicated React Query mutation hook that uses the existing useActor hook to call the backend submitFeedback method, normalizes thrown errors into user-displayable messages, and exposes in-flight state for disabling the submit button. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/feedback/FeedbackFormSection.tsx",
          "operation": "modify",
          "description": "Integrate useSubmitFeedbackMutation: on submit, call the mutation, disable submit while pending to prevent duplicates, show a loading state, handle backend errors gracefully (render English error text), and on success reset the form and show an English confirmation message. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the placeholder hook barrel to export the new feedback submission hook (or document that hooks are now split), without touching restricted hook files. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}